app/controllers/songs_controller.rb

  def new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      redirect_to artists_path, alert: "Artist not found."
    else
      @song = Song.new(artist_id: params[:artist_id])
      @song.save
---
SELECT "artists".* FROM "artists"
INSERT INTO "songs" ("artist_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["artist_id", 6], ["created_at", "2017-08-23 19:52:14.981144"], ["updated_at", "2017-08-23 19:52:14.981144"]]